[
  {"language": "PT", "usedTech": "Tecnologias empregadas", "text": "Já trabalhei com algumas tecnologias até o momento. No front-end com JavaScript e React, e neste último, utilizei ferramentas como React Hooks, Context API, Redux e React Testing Library(RTL). Já no back-end, utilizei a lnguagem JavaScript e TypeScript por meio do Node.js. Utilizei contêineres,banco de dados relacionais, MySQL/Sequelize e criei APIs com Express, fazendo uma aplicação em camadas em um sistema análogo à Model, View e Controller(MVC). Por último, mesmo que superficialmente, utilizei a programação orientada à objetos(POO), utilizando o SOLID.", "frontend": "Front end", "backend": "Back end", "design": "Design", "frontText": "Experiência com  React.js, React Hooks, Context API, Redux e React Testing Library(RTL)", "backText": "Experiência com Node.js, MYSQL, Express, TypeScript e POO", "designText": "Experiência com ferramentas como Photoshop e ibisPaint"},
  {"language": "EN", "usedTech": "Employed technologies", "text": "ENGLISHJá trabalhei com algumas tecnologias até o momento. No front-end com JavaScript e React, e neste último, utilizei ferramentas como React Hooks, Context API, Redux e React Testing Library. Já no back-end, utilizei a lnguagem JavaScript e TypeScript por meio do Node.js, utilizando. Utilizando contêineres, crio espaços isolados para rodar os códigos das aplicações, de modo que elas se tornam compatíveis com os mais variados sistemas e máquinas. Sei também criar banco de dados com MySQL, seja puramente com comandos SQL ou com a ORM Sequelize e utilizo as boas práticas de criar APIs com Express, fazendo uma aplicação em camadas em um sistema análogo à Model, View e Controller(MVC). Por último, mesmo que superficialmente, utilizei a programação orientada à objetos(POO), utilizando o SOLID.", "frontend": "Front end", "backend": "Back end", "design": "Design", "frontText": "Experience with React.js", "backText": "Experience with Node.js and MYSQL", "designText": "Experience with tools like Photoshop and ibisPaint"},
  {"language": "JP", "usedTech": "Tecnologias empregadas", "text": "Já trabalhei com algumas tecnologias até o momento. No front-end com javascript e react(LISTAR OUTRAS AQUI (REACT HOOKS, CONTECT API, ...)) e no back-end com javascript/typescript(EXPRESS, .....)", "frontend": "Front-end", "backend": "Back-end", "design": "Design", "frontText": "Experience with React.js", "backText": "Experience with Node.js and MYSQL", "designText": "Experience with tools like Photoshop and ibisPaint"}
]