[
  {"language": "PT", "usedTech": "Tecnologias empregadas", "text": "Já trabalhei com algumas tecnologias até o momento. No front end com JavaScript e React, e neste último, utilizei ferramentas como React Hooks, Context API, Redux e React Testing Library(RTL). Já no back end, utilizei as linguagens JavaScript e TypeScript por meio do NodeJs. Utilizei contêineres, banco de dados relacionais, MySQL/Sequelize e criei APIs com Express, fazendo uma aplicação em camadas em um sistema análogo à Model, View e Controller(MVC). Por último, mesmo que superficialmente, utilizei a programação orientada à objetos(POO), utilizando os príncipios do SOLID.", "frontend": "Front end", "backend": "Back end", "design": "Design", "frontText": "Experiência com  React.js, React Hooks, Context API, Redux e React Testing Library(RTL)", "backText": "Experiência com Node.js, MYSQL, Express, TypeScript e POO", "designText": "Experiência com ferramentas como Photoshop e ibisPaint"},
  {"language": "EN", "usedTech": "Employed technologies", "text": "I've already worked with some technologies. In front end, with JavaScript and React. In the latter, I also used other tools like React Hooks, Context API, Redux e React Testing Library(RTL). In back end, through NodeJs I worked with JavaScript and TypeScript. I already worked with containers, relational databases, MySQL, Sequelize and created APIs with Express, making applications in layers in a system analog with Model, View and Controller(MVC). Even superficially, I used the object-oriented programming(OOP), using SOLID principles.", "frontend": "Front end", "backend": "Back end", "design": "Design", "frontText": "Experience with React.js", "backText": "Experience with Node.js and MYSQL", "designText": "Experience with tools like Photoshop and ibisPaint"},
  {"language": "JP", "usedTech": "用いました技術", "text": "今までいくつかの技術は用いたことがあります。フロントエンドでは、JavaScriptとReactを用いました。それに、他の技術も使いました。例えば: React Hooks、Context API、 Redux、 React Testing Library (RTL)。バックエンドでは、 NodeJsを通してJavaScriptもTypescriptもプログラミングしました。また、Dockerのコンテナ、関係データベース、MySQL、Sequelizeなどを用いました。Expressを通じて、APIを作りました。アップリはレイヤーのModel-View-Controller/モデル・ビュー・コントローラ (MVC) がありました。表面上けど、オブジェクト指向プログラミング(OOP) 、SOLIDの原論を従いました。", "frontend": "フロントエンド", "backend": "バックエンド", "design": "デザイン", "frontText": "React.js、 React Hooks、 Context API、 Redux、 React Testing Library(RTL)を体験しました", "backText": "Node.js、MYSQL、Express、TypeScript、POOを体験しました", "designText": "PhotoshopとibisPaintを体験しました"}
]